let teploty = [15,17,19,21,23,15,16,20];
console.log(teploty[5]);
teploty[0] = 17;
// teploty[8] = 21;

// так добавляется новый параметр в конец.
teploty.push(21)
teploty.push(25)
teploty.push(28)

// так удаляется последний параметр
teploty.pop();

// так добавляется параметр вперед. но так лучше не делать, потому что переиндексуются все параметры
teploty.unshift(10)

// так удаляется первый параметр. так тоже лучше не делать, по той же причине
teploty.shift();

// в поле можно придавать какую угодно информацию, но лучше использовать одинаковые типы информации. только цифры, только функции, нолько слова.
let novePole = ["spartak", 27, undefined, null];


// так можно выбрать послежний элемент массива
teploty[teploty.length - 1]
teploty.at(-1)


// Так можно узнать индекс элемента, который ты знаешь. то есть знаешь чему равен этот элемент, но не знаешь какой у него индекс
console.log(teploty.indexOf(25))

let lidi = ["Adam", "Borek", "Cyril", "Dana", "Eva"]

for( let index = 0; index <5; index++){
    console.log(lidi[index])
}

