
function privitej(day, jak) {
    console.log( + day + ' je '  + jak );
    console.log("proc");
    console.log("zac");
    console.log("kde");
}
privitej(21.5, 'dobry');
// так я сначала создаю функцию, а затем ее запускаю
// далее я создаю переменную в скобках у функции, а затем когда вызываю функцию то указываю что внутри переменной и называется это "параметры" и "аргументы".  Параметры это переменная которую я создаю а аргументы это когда я вызываю функцию и устанавливаю что будет в параметре.

privitej(22.5, 'hezky');

privitej(23.5, 'spatne');